{"dictionary":{"_MAIN_TITLE_":"Darch","_CODE_EXAMPLE_SECTION_TITLE_":"Exemplo","_CODE_EXAMPLE_RESULT_SECTION_TITLE_":"Resultado","_MODULES_SECTION_TITLE_":"Módulos","_CONTAINER_LABEL_TEXT_":"Container","_COMPONENT_LABEL_TEXT_":"Componente","_MODULE_LABEL_TEXT_":"Módulo","_SEND_":"Enviar","_NOTE_":"Observação","_LOADING_":"Processando...","_SHOW_MODAL_ACTION_LABEL_":"mostrar modal","_EMAIL_FIELD_LABEL_":"Seu email","_EMAIL_FIELD_PLACEHOLDER_":"macaco@jumento.com","_PASSWORD_FIELD_LABEL_":"Senha","_PASSWORD_FIELD_PLACEHOLDER_":"••sigilooooo","_UNMASK_PASSWORD_LABEL_":"mostrar","_MASK_PASSWORD_LABEL_":"esconder","_SELECT_FIELD_LABEL_":"Opções (pesquise por num)","_FIELD_ERROR_REQUIRED_":"Esse campo é obrigatório.","_FIELD_ERROR_EMAIL_":"Esse campo deve ser um email válido.","_PROP_TABLE_PROPERTY_TH_":"Propriedade","_PROP_TABLE_TYPE_TH_":"Tipo","_PROP_TABLE_DEFAULT_TH_":"Default","_PROP_TABLE_DESCRIPTION_TH_":"Descrição","_DEFAULT_VALIDATOR_TABLE_NAME_TH_":"Nome","_DEFAULT_VALIDATOR_TABLE_OPTS_TH_":"Opções","_DEFAULT_VALIDATOR_TABLE_DESCRIPTION_TH_":"Descrição","_CUSTOM_VALIDATOR_TABLE_KEY_TH_":"Chave","_CUSTOM_VALIDATOR_TABLE_TYPE_TH_":"Tipo","_CUSTOM_VALIDATOR_TABLE_DESCRIPTION_TH_":"Descrição","_INTRO_":"Bem vinda(o) à documentação do Darch, um framework de componenentes e utilitários para React utilizado nos projetos da Nosebit. O projeto adota um design minimalista e tecnologias web de ponta como <a href=\"https://github.com/css-modules/css-modules\">CSS MODULES</a> e <a href=\"https://webpack.js.org/\">Webpack</a> em que todas as dependências de um módulo são empacotadas num mesmo arquivo.","_SECTION_USAGE_TITLE_":"Utilização","_SECTION_USAGE_TEXT_1_":"Instale o Darch via npm através do comando:","_SECTION_USAGE_TEXT_2_":"Após a instalação, você pode importar cada módulo individualmente usando:","_SECTION_USAGE_TEXT_3_":"O <i>import</i> de cada módulo individual é o melhor esquema para manter seu código o mais enxuto possível, pois nesse caso apenas as dependências diretas do módulo importado serão carregados para seu código. Caso você deseja importar todo o Darch, então você pode importar módulos mais facilmente da seguinte forma:","_SECTION_USAGE_STYLES_CALLOUT_TITLE_":"Importante","_SECTION_USAGE_STYLES_CALLOUT_TEXT_":"Caso você opte por apenas importar módulos separadamente, será necessário importar o módulo <code>styles</code> em algum momento no seu código, ou seja, insira <code>import \"darch/lib/styles\"</code> em algum lugar. Sem esse módulo, os estilos gerais do Darch não serão aplicados.","_SECTION_GRID_INTRO_":"O sistema de grid do Darch é composto por um componente pai <code>Grid</code> seguido de um ou mais componentes filhos <code>Grid.Cell</code>. Cada célula recebe por <i>default</i> uma propriedade <code>span</code> igual a 1 que representa o percentual de espaço que a célula deve reservar para si.","_SECTION_GRID_COMP_GRID_PROP_SPOTS_DESCRIPTION_":"Determina o número máximo de spots disponíveis para as células ocuparem. Dessa forma, se você configurar spots=4, por exemplo, e apenas 3 células com span=1 cada, um spot vai ficar faltando :)","_SECTION_GRID_COMP_CELL_PROP_SPAN_DESCRIPTION_":"Determina o percentual de comprimento do Grid que a célula irá ocupar. Assim, num grid com duas células de spans span1=3 e span2=2 a primeira célula irá ocupar 3/(3+2)=60% do comprimento e a segunda célula irá ocupar 2/(3+2)=40% do comprimento do grid.","_SECTION_BAR_INTRO_":"Esse componente renderiza uma barra de navegação responsiva geralmente posicionada no topo da página.","_SECTION_BAR_CODE_EXAMPLE_RESULT_TEXT_":"A barra de navegação no topo desta página.","_SECTION_BAR_COMP_BAR_PROP_FIXEDONTOP_DESCRIPTION_":"Determina se a barra deve se manter fixa no topo da página.","_SECTION_BAR_COMP_BAR_PROP_OPEN_DESCRIPTION_":"Determina se o menu da barra está aberto. Essa propriedade só atua em tela  mobile, pois nos demais casos o menu sempre se apresenta aberto.","_SECTION_BAR_COMP_BAR_PROP_ONTOGGLE_DESCRIPTION_":"Função que é chamada quando o menu da barra deve sofrer toggle, ou seja, alterar o valor da propriedade <code>open</code>. Dessa forma, a responsabilidade por abrir e fechar o menu da barra é totalmente do cliente que instancia a barra.","_SECTION_BAR_COMP_CONTAINER_INTRO_":"Adiciona um container a todo conteúdo da barra para centralizá-lo igualmente ao componente <code>Container</code> usado no corpo da página.","_SECTION_BAR_COMP_CONTAINER_PROP_WITHBOTTOMLINE_DESCRIPTION_":"Determina se uma linha deve ser adiciona na parte de baixo do container para melhor distinção do conteúdo da barra (útil quando a barra é fixa no topo igual à bara usada nesta doc).","_SECTION_BAR_COMP_HEADER_INTRO_":"O cabeçalho da barra contém os elementos que se localizam à esquerda na barra e que geralmente são \"sempre\" visíveis. Esta sessão costuma conter a logo do projeto, o componente <code>Bar.Toggle</code> e algum <code>Bar.Menu</code> que se deseje manter visível próximo da logo.","_SECTION_BAR_COMP_BODY_INTRO_":"O corpo da barra contém os elementos que se localizam à direita na barra e que geralmente são \"colapsáveis\".","_SECTION_BAR_COMP_MENU_PROP_TOGGLABLE_DESCRIPTION_":"Determina se o menu é colapsável. Atualmente, todos os menus dentro do header são forçadamente setados para togglable=false e todos os demais menus são togglable=true por padrão.","_SECTION_BAR_COMP_ITEM_INTRO_":"Um item de um menu da barra. Simples assim :)","_SECTION_BAR_COMP_TOGGLE_INTRO_":"Esse componente representa o botão que exibe ou colapsa os menu da barra quando em ambiente mobile.","_SECTION_BAR_COMP_TOGGLE_PROP_OPENCOMPONENT_DESCRIPTION_":"Elemento que é exibido quando os menu da barra estão colapsados. Ao ser clicado, esse elemento exibe os menu colapsados. Por padrão, esse componente é um ícone de três barras horizontais.","_SECTION_BAR_COMP_TOGGLE_PROP_CLOSECOMPONENT_DESCRIPTION_":"Elemento que é exibido quando os menus da barra estão visíveis. Ao ser clicado, ele elemento colapsa os menus visíveis. Por padrão, esse componente é um ícone de três barras horizontais.","_SECTION_FORM_INTRO_":"O componente de form permite essencialmente validações dos campos do formulário antes da submissão. Em geral, cada <code>Form</code> é composto por múltimos <code>Field</code> que permitem ao usuário inserir valores que são registrados como estado interno do form e passados para o cliente na hora da submissão. Implementamos uma variedade de fields que serão tratados mais adiante.","_SECTION_FORM_COMP_FORM_PROP_LOADING_DESCRIPTION_":"Determina se o form está em estado de loading ou não. Em geral é setado para <code>true</code> quando a função <code>onSubmit</code> é chamada.","_SECTION_FORM_COMP_FORM_PROP_SHOWERRORSON_DESCRIPTION_":"Determina o evento que dispara a exibição de mensagens de erro ocasionais definidas por componentes <code>Field.Error</code> devem ser exibidas. Apenas os eventos blur, change ou submit são permitidos.","_SECTION_FORM_COMP_FORM_PROP_CLEARERRORONBECOMEVALID_DESCRIPTION_":"Determina se os erros associados a um validador devem ser removidos assim que o validador se tornar válido.","_SECTION_FORM_COMP_FORM_PROP_DISABLESUBMITBUTTONONERRORS_DESCRIPTION_":"Determina se o botão de submit do form deve ser desabilitado no caso de erros.","_SECTION_FORM_COMP_FORM_PROP_DISABLESUBMITBUTTONONVALIDATING_DESCRIPTION_":"Determina se o botão de submit do form deve ser desabilitado enquanto algum field está sendo validado (validações podem ser assíncronas).","_SECTION_FORM_COMP_FORM_PROP_ONSUBMIT_DESCRIPTION_":"Função que é chamada quando o usuário submete o form (geralmente através de um clique no botão de submit). Essa função recebe como único argumento um objeto cuja chave é a propriedade <b>name</b> de cada <code>Field</code> presente no <code>Form</code> e o valor associado a essa chave é o valor inserido pelo usuário no <code>Field</code>.","_SECTION_FORM_NOTE_CALLOUT_TEXT_":"Vários componentes no Darch podem receber chaves que são traduzidas para um idioma alvo, como <code>placeholder</code> e <code>message</code> nos componentes <code>Field.Text</code> e <code>Field.Error</code> respectivamente. No caso do componente <code>Button</code>, utilizamos o componente <code>i18n.Translate</code> diretamente para tomar o texto traduzido associado à chave <code>_SEND_</code>.","_SECTION_FIELD_INTRO_":"Um campo é um elemento no qual o usuário pode inserir valores e que gerencia a formatação/parsing desses valores inseridos. Geralmente campos são utilizados dentro de um componente <code>Form</code>, o qual é responsável por executar validadores definidos pelos campos em momentos específicos e exibir mensagens de erro.","_SECTION_FIELD_NAME_WARNING_CALLOUT_TITLE_":"Atenção","_SECTION_FIELD_NAME_WARNING_CALLOUT_TEXT_":"Cada <code>Field</code> dentro de um componente <code>Form</code> precisa definir uma propriedade <code>name</code> que identifica unicamente o campo.","_SECTION_FIELD_COMP_BASE_INTRO_":"Todo <code>Field</code> no Darch (com exceção de <code>Field.Error</code> e <code>Field.Section</code>) é encapsulado pelo componente <code>Field.Base</code> que funciona como interface entre o <code>Form</code> e o <code>Field</code> específico que ele contém. Dessa forma, todo <code>Field</code> aceita as propriedades definidas pelo <code>Field.Base</code> além daquelas propriedade definidas pelo próprio <code>Field</code> específico.","_SECTION_FIELD_COMP_BASE_PROP_VALIDATORS_DESCRIPTION_":"Define os validadores que devem ser aplicados no valor inserido pelo usuário. Pode ser uma string no formato <code>validador_1:opts|...|validador_n:opts</code>, onde <code>validador_n</code> é o nome de um validador padrão (mais sobre isso em breve) e <code>opts</code> é uma lista de opções no formato <code>opt_1:opt_2:...:opt_m</code> que são passadas ao validador padrão. Pode também ser um array de strings no formato <code>validador:opts</code> como antes ou então um objeto que define um validador personalizado (mais sobre isso adiante).","_SECTION_DEFAULT_VALIDATORS_TITLE_":"Validador Padrão","_SECTION_DEFAULT_VALIDATORS_INTRO_":"Validadores padrão são aqueles que podem ser referenciados por uma string no formato <code>nome:opts</code> onde <code>nome</code> representa o nome do validador e <code>opts</code> é uma lista de opções no formato <code>opt_1:...:opt_n</code> que é passada para o validador na hora da validação. A seguir apresentamos a lista de validadores padrão implementados no Darch (todos começados com o caracter <code>$</code> para fins de clareza).","_SECTION_DEFAULT_VALIDATORS_REQUIRED_DESCRIPTION_":"Valida se algum valor foi inserido no campo.","_SECTION_DEFAULT_VALIDATORS_EMAIL_DESCRIPTION_":"Valida se o valor inserido no campo é um email válido.","_SECTION_DEFAULT_VALIDATORS_ALPHANUMERIC_DESCRIPTION_":"Valida se o valor inserido contém apenas caracteres alfanuméricos, ou seja, caracteres a-z,A-Z ou dígitos 0-9.","_SECTION_DEFAULT_VALIDATORS_LOWERCASE_DESCRIPTION_":"Valida se o valor inserido contém apenas caracteres minúsculos a-z ou dígitos 0-9.","_SECTION_DEFAULT_VALIDATORS_UPPERCASE_DESCRIPTION_":"Valida se o valor inserido contém apenas caracteres maiúsculos A-Z ou dígitos 0-9.","_SECTION_DEFAULT_VALIDATORS_DIGITS_DESCRIPTION_":"Valida se o valor inserido contém apenas dígitos 0-9.","_SECTION_DEFAULT_VALIDATORS_DOMAIN_DESCRIPTION_":"Valida se o valor inserido é uma URL válida.","_SECTION_DEFAULT_VALIDATORS_EQUAL_DESCRIPTION_":"Valida se o valor inserido é igual ao valor inserido num outro campo cujo <code>name</code> é especificado na primeira opção passada para o validador.","_SECTION_DEFAULT_VALIDATORS_REGISTER_CALLOUT_TITLE_":"Nota","_SECTION_DEFAULT_VALIDATORS_REGISTER_CALLOUT_TEXT_":"Um validador padrão pode ser registrado junto ao <code>Form</code> através da função <code>Form.registerValidator(schema)</code> que recebe como parâmetro um objeto que define o validador da mesma forma como um validador personalizado é definido (ver abaixo).","_SECTION_CUSTOM_VALIDATORS_TITLE_":"Validador Personalizado","_SECTION_CUSTOM_VALIDATORS_INTRO_":"Um validador personalizado é definido por um objeto com as seguintes chaves:","_SECTION_CUSTOM_VALIDATORS_KEY_NAME_DESCRIPTION_":"Nome que identifica o validador. A unicidade desse nome é importante no caso em que vamos registrar o validador como um validador padrão, uma vez que o validador registrado por último irá sobreescrever a definição de outro validador com mesmo nome.","_SECTION_CUSTOM_VALIDATORS_KEY_WATCH_DESCRIPTION_":"Nome ou lista de nomes de outros <code>Field</code> do <code>Form</code> que o validador deve observar. Toda vez que o valor de um dos campos especificado for alterado, o validador será executado em seguida. No caso de registrar esse validador como um validador padrão, pode-se utilizar um inteiro que representa a opção (na lista de opções que serão passadas ao validador) que contém o nome do campo.","_SECTION_CUSTOM_VALIDATORS_KEY_ON_DESCRIPTION_":"Nome do evento que dispara essa validação. Os eventos permitidos são blur, change ou submit. Caso não seja fornecido, então o validador herda o evento do <code>Form</code> pai.","_SECTION_CUSTOM_VALIDATORS_KEY_VALIDATE_DESCRIPTION_":"Função que é chamada no momento da validação. Essa função possui a forma <code>function(value, context)</code> onde: (1) <code>value</code> é o valor do campo a ser validado; (2) <code>context</code> é um objeto com forma <code>{values: {..}}</code> onde <code>values</code> é um dicionário com todos os valores atuais inseridos no <code>Form</code> (interessante para validações cruzadas). Essa função deve retornar <code>true</code> caso o valor seja válido ou <code>false</code> caso contrário. Para permitir validações assíncronas, essa função pode retornar também uma promesa que resolve para um booleano como antes.","_SECTION_FIELD_COMP_ERROR_INTRO_":"Esse componente exibe uma mensagem de erro quando um validador específico de um campo específico retorna <code>false</code> como resultado da validação.","_SECTION_FORM_COMP_ERROR_PROP_FOR_DESCRIPTION_":"Nome do <code>Field</code> ao qual o erro está associado.","_SECTION_FORM_COMP_ERROR_PROP_VALIDATOR_DESCRIPTION_":"Nome do validador do <code>Field</code> ao qual o erro está associado.","_SECTION_FORM_COMP_ERROR_PROP_MESSAGE_DESCRIPTION_":"Mensagem que será exibida quando o validador associado retornar <code>false</code> como resultado da validação. Essa mensagem será traduzida automaticamente pelo módulo <code>i18n</code> se houver uma tradução disponível (ver mais detalhes na doc sobre o módulo <code>i18n</code>).","_SECTION_FIELD_COMP_TEXT_INTRO_":"O campo de texto permite que o usuário insira strings (texto, dãã).","_SECTION_FIELD_COMP_PASSWORD_INTRO_":"Segundo um post interessante do site <a href=\"http://uxmovement.com/forms/why-the-confirm-password-field-must-die/\" target=\"_blank\">uxmovement</a> pesquisas mostram que a velha técnica de exibir um campo de senha seguido por um campo de confirmação chegou a reduzir em até 1/4 o número de cadastros numa pesquisa associada ao post. Um processo de cadastro deve ser o mais simples e com menor número de campos possíveis para que não haja perda significativa na taxa de conversão de clientes. Técnicas interessantes adotadas para se reduzir o número de erros na hora do usuário inserir uma senha são, por exemplo, a opção de mostrar a senha e exibir o último caracter digitado pelo usuário (iOS). O componente <code>Field.Password</code> implementa essas duas estratégias e exibe ainda um medidor da \"força\" da senha digitada pelo usuário.","_SECTION_FIELD_COMP_PASSWORD_PROP_ALLOWUNMASK_DESCRIPTION_":"Determina se será exibido um botão que permite ao usuário exibir a senha.","_SECTION_FIELD_COMP_PASSWORD_PROP_UNMASKLABEL_DESCRIPTION_":"Label do botão que exibe a senha do usuário.","_SECTION_FIELD_COMP_PASSWORD_PROP_MASKLABEL_DESCRIPTION_":"Label do botão que esconde a senha do usuário.","_SECTION_FIELD_COMP_PASSWORD_PROP_SHOWSTRENGTH_DESCRIPTION_":"Determina se será exibido um medidor de força da senha inserida pelo usuário.","_SECTION_FIELD_COMP_PASSWORD_PROP_MASKCHAR_DESCRIPTION_":"Caracter que é utilizado na máscara dos caracteres da senha inserida.","_SECTION_FIELD_COMP_PASSWORD_PROP_MASKTIMEOUT_DESCRIPTION_":"Tempo (em milisegundos) em que o último caracter inserido pelo usuário deve ficar visível antes de ser convertido no maskChar.","_SECTION_FIELD_COMP_PASSWORD_PROP_EVALSTRENGTH_DESCRIPTION_":"Função que calcula a força da senha inserida pelo usuário. Recebe apenas um argumento (advinhem qual) e deve retornar um número de 0 a 100 que representa a força da senha (0 para senha fraca e 100 para senha forte).","_SECTION_FIELD_COMP_SELECT_INTRO_":"O elemento <code>select</code> do browser em geral é muito limitado, não oferecendo suporte a pesquisa ou carregamento de opções de maneira assíncrona ou seleção de múltiplas opções. O componente <code>Field.Select</code> implementa todas essas <i>features</i>.","_SECTION_FIELD_COMP_SELECT_PROP_VALUE_DESCRIPTION_":"Valor (string) ou valores (array de strings) selecionado(s) pelo usuário.","_SECTION_FIELD_COMP_SELECT_PROP_OPTIONS_DESCRIPTION_":"Lista de opções a serem exibidas no menu do select. Cada opção deve ser um objeto contendo as seguintes chaves: (1) <code>value</code>: string que representa o valor da opção escolhida pelo usuário; (2) <code>label</code>: texto que representa o valor e que será exibido (traduzido) no menu do select; (3) <code>action</code>: ação que deve ser executada quando a opção for selecionada (nesse caso, o <code>value</code> da opção não é selecionado); (4) <code>async</code>: determina se a ação é assíncrona; (5) <code>preventLabelMatchHighlight</code>: impede que o label desta opção sofra highlight durante a pesquisa.","_SECTION_FIELD_COMP_SELECT_PROP_LOADING_DESCRIPTION_":"Determina se o select está carregando opções ou não.","_SECTION_FIELD_COMP_SELECT_PROP_LOADINGLABEL_DESCRIPTION_":"Texto exibido no menu quando select está carregando opções.","_SECTION_FIELD_COMP_SELECT_PROP_LOADOPTIONS_DESCRIPTION_":"Função que é chamada pelo select sempre que for necessário carregar novas opções. Essa função recebe como único parâmetro o valor inserido pelo usuário no campo de pesquisa.","_SECTION_FIELD_COMP_SELECT_PROP_LOADOPTIONSTIMEOUT_DESCRIPTION_":"Tempo (em milisegundos) que se deve esperar para se carregar novas opções depois que o usuário inseriu o último caracter no campo de pesquisa (tempo de inatividade).","_SECTION_FIELD_COMP_SELECT_PROP_NOOPTIONSLABEL_DESCRIPTION_":"Texto que é exibido no menu do select quando nenhuma opção foi encontrada para o valor pesquisado.","_SECTION_FIELD_COMP_SELECT_PROP_MULTI_DESCRIPTION_":"Determina se o select permite ou não a seleção de múltiplos valores.","_SECTION_FIELD_COMP_SELECT_PROP_CREATABLE_DESCRIPTION_":"Determina se o select deve mostrar uma ação de \"criar nova opção\" quando nenhuma opção foi encontrada para o valor pesquisado.","_SECTION_FIELD_COMP_SELECT_PROP_CREATEOPTIONLABEL_DESCRIPTION_":"Texto que é exibido na ação de criar nova opção.","_SECTION_FIELD_COMP_SELECT_PROP_ONCREATEOPTION_DESCRIPTION_":"Função que é chamada quando o usuário executa a ação de inserir nova opção. Essa função recebe como único argumento o valor inserido pelo usuário no campo de pesquisa.","_SECTION_FIELD_COMP_SELECT_PROP_CREATEOPTIONASYNC_DESCRIPTION_":"Determina se a ação de criar opção (i.e., a função <code>onCreateOption</code>) é assíncrona.","_SECTION_FIELD_COMP_SELECT_PROP_SELECTOPTIONAFTERCREATE_DESCRIPTION_":"Determina se uma nova opção recém criada deve ser automaticamente selecionada pelo select.","_SECTION_FIELD_COMP_SELECT_PROP_SEARCHABLE_DESCRIPTION_":"Determina se o input de pesquisa deve ser exibido para que o usuário pesquise por opções.","_SECTION_FIELD_COMP_SELECT_PROP_PLACEHOLDER_DESCRIPTION_":"Texto que é exibido no campo de pesquisa quando ele está vazio.","_SECTION_FIELD_COMP_SELECT_PROP_OPENMENUONSEARCHFOCUS_DESCRIPTION_":"Determina se o menu de opções deve ser aberto assim que o input de pesquisa ganha foco do usuário.","_SECTION_FIELD_COMP_SELECT_PROP_CLEARSEARCHONBLUR_DESCRIPTION_":"Determina se o valor do input de pesquisa deve ser removido quando ele perde o foco do usuário.","_SECTION_FIELD_COMP_SELECT_PROP_CLEARSEARCHONMENUCLOSE_DESCRIPTION_":"Determina se o valor do input de persquisa deve ser removido quando o menu de opções é fechado.","_SECTION_FIELD_COMP_SELECT_PROP_LABELMATCHHIGHLIGHT_DESCRIPTION_":"Determina se a parte do label das opções que casa com o valor inserido no campo de pesquisa deve ser destacado ou não.","_SECTION_FIELD_COMP_SELECT_PROP_ONMENUCLOSE_DESCRIPTION_":"Função que é chamada quando o menu de opções acabou de ser fechado.","_CODE_EXAMPLE_SECTION_TITLE_MULTI_SELECT_":"Múltiplos Valores","_CODE_EXAMPLE_SECTION_TITLE_SINGLE_SELECT_":"Valor Único"}}